
## Plan Result (aws/eks)

[CI link](https://github.com/44smkn/terraform/actions/runs/1973811766)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.eks.module.eks.kubernetes_config_map.aws_auth[0]
  * module.eks.module.eks.local_file.kubeconfig[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.eks.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::171457761414:role/44smkn-test2022031215250037830000000b"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://25390B9E092E5B1C298FBF9B4E411118.gr7.ap-northeast-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhNakUxTWpJeE9Gb1hEVE15TURNd09URTFNakl4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTk1WCkxXT2pOQ3BkZHE5eTFQU2pGZ1ZNMXlJYkRvUmNodSt4eXVWcDdCNW1WWXJ5T1N0MkdSUnZpNnVsWEFSbVh6a0UKL0VsUFpra0R5bloxbjlKZ0dKWlV4Vll5STFCR3JtcTB5V0hWakdtdEpvMC9ONDlpclVhbGUvbmUxUmx0YlZ4TApseGFQY3pPYTBtdFdmamZMYjlGbWN4YUdSMVRWY2JPaTB2cWZGSFBnZXp0dmdpZTQ3ZFNHQ0FpeWduQS9YL0RLCnVPL0ZEWDM4N0kzMUZyZTBvWW5YeEdSS2ZhYXFrV3d4UHI5cmJQQlJsZ0JhYWtTMXprcWRCM2tzSkRSWkRLUFkKZzZtU0lhbUoxWmdWRkltV1VXcVFjTmlmQW92YWFuQ0dSc1JBVjhPdURzaVRabllIRmhERjBwMlF5Z1dQaWVVKwpDanJ3Sk0waTFPMytkV001em9zQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZCRzNOaU9qNkQwZ0c2Q0dibWZsNmpvTkdhT21NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCY1QxNml4d2VuQkdSQXQ1c1pCMitaLzZPOXNPY2s5SG1TcHpYbWEvY0xnNHpKTGUwQgpvTW5qa2loaXVMSVh5YXJOVkdPYUIwaktwbTJ4RDJCQzg1bGN3WG82WGRNSkoxV0FpTmRhOGM3OS9ndE10c2tQCkd2K2Y5UnV1L0RZSTZKY08wb09LMUJTZHlQcE91NHdVbStYcVM0TklyRG1kWUcyZEYrZ0FjdVowYlM0OWxISm0KcEQ5dUw5dlh2THFJaXdqY1dralBjY205Ry9QV0s2ellrbUErcS9EU2JmRkVPOU1PYWtNcnNPaitMYVJoK2FvcgpvS1BNTENmK2w0cjVEbUZzc1BlQS9WUDExV2EwNThDTGJ5aTlML0dXM1dGNERIa3NicnVNT3NJcTZzT01aOGpsCmhuQ0dDWkNNWlhySXZmdVVWeFBYc2h4ODk3cUlmK3h4a3VwTwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_44smkn-test
            
            contexts:
            - context:
                cluster: eks_44smkn-test
                user: eks_44smkn-test
              name: eks_44smkn-test
            
            current-context: eks_44smkn-test
            
            users:
            - name: eks_44smkn-test
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "44smkn-test"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_44smkn-test"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://25390B9E092E5B1C298FBF9B4E411118.gr7.ap-northeast-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhNakUxTWpJeE9Gb1hEVE15TURNd09URTFNakl4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTk1WCkxXT2pOQ3BkZHE5eTFQU2pGZ1ZNMXlJYkRvUmNodSt4eXVWcDdCNW1WWXJ5T1N0MkdSUnZpNnVsWEFSbVh6a0UKL0VsUFpra0R5bloxbjlKZ0dKWlV4Vll5STFCR3JtcTB5V0hWakdtdEpvMC9ONDlpclVhbGUvbmUxUmx0YlZ4TApseGFQY3pPYTBtdFdmamZMYjlGbWN4YUdSMVRWY2JPaTB2cWZGSFBnZXp0dmdpZTQ3ZFNHQ0FpeWduQS9YL0RLCnVPL0ZEWDM4N0kzMUZyZTBvWW5YeEdSS2ZhYXFrV3d4UHI5cmJQQlJsZ0JhYWtTMXprcWRCM2tzSkRSWkRLUFkKZzZtU0lhbUoxWmdWRkltV1VXcVFjTmlmQW92YWFuQ0dSc1JBVjhPdURzaVRabllIRmhERjBwMlF5Z1dQaWVVKwpDanJ3Sk0waTFPMytkV001em9zQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZCRzNOaU9qNkQwZ0c2Q0dibWZsNmpvTkdhT21NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCY1QxNml4d2VuQkdSQXQ1c1pCMitaLzZPOXNPY2s5SG1TcHpYbWEvY0xnNHpKTGUwQgpvTW5qa2loaXVMSVh5YXJOVkdPYUIwaktwbTJ4RDJCQzg1bGN3WG82WGRNSkoxV0FpTmRhOGM3OS9ndE10c2tQCkd2K2Y5UnV1L0RZSTZKY08wb09LMUJTZHlQcE91NHdVbStYcVM0TklyRG1kWUcyZEYrZ0FjdVowYlM0OWxISm0KcEQ5dUw5dlh2THFJaXdqY1dralBjY205Ry9QV0s2ellrbUErcS9EU2JmRkVPOU1PYWtNcnNPaitMYVJoK2FvcgpvS1BNTENmK2w0cjVEbUZzc1BlQS9WUDExV2EwNThDTGJ5aTlML0dXM1dGNERIa3NicnVNT3NJcTZzT01aOGpsCmhuQ0dDWkNNWlhySXZmdVVWeFBYc2h4ODk3cUlmK3h4a3VwTwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_44smkn-test
            
            contexts:
            - context:
                cluster: eks_44smkn-test
                user: eks_44smkn-test
              name: eks_44smkn-test
            
            current-context: eks_44smkn-test
            
            users:
            - name: eks_44smkn-test
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "44smkn-test"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_44smkn-test" -> null
      - id                   = "0890b48d34cbe3a4ba407af709969efb84dfe5fa" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":27,"Program":"tfcmt","SHA1":"68b0d645cf3c173b87e6127aa3183f30b77b4aab","Target":"aws/eks","Vars":{},"WorkflowName":"test"} -->